In [2]:
name="Jimihua"
greeting="meow"
legs=4
daily_food_requirement_lbs=0.25
food_stash_lbs=10.0

def greet(who):
    print(greeting+", "+who)
    

def eat():
    global food_stash_lbs
    food_stash_lbs-=daily_food_requirement_lbs
    print(food_stash_lbs)
    
    
eat()

9.75

In [ ]:
name = "anubis"
greeting="meow"
legs=4
daily_food_requirement_lbs=1.5
food_stash_lbs=40.0

In [8]:
class Animal:
    
    def __init__(self,name,greeting,legs,daily_food_requirement_lbs,food_stash_lbs):
        self.name=name
        self.greeting=greeting
        self.legs=legs
        self.daily_food_requirement_lbs=daily_food_requirement_lbs
        self.food_stash_lbs=food_stash_lbs
        self.food_reup_amount=food_stash_lbs
        
        self.legs_per_side=legs/2
        
    def greet(self,who):
        print(self.greeting +", "+who)
        
    def eat(self):
        if self.food_stash_is_sufficient():
            self.food_stash_lbs-=self.daily_food_requirement_lbs
            print(self.food_stash_lbs)
        else:
            print("I'm hungry")
        
    def food_stash_is_sufficient(self):
        return self.food_stash_lbs>=self.daily_food_requirement_lbs
    
    def buy_new_bag_of _food(self):
        self.food_stash_lbs+=self.food_reup_amount
        
jimihua = Animal("Jimihua","meow",4,0.25,10.0)
anubis = Animal("Anubis","meow",4,1.5,40.0)


jimihua.greet("Nick")
anubis.eat()

meow, Nick
38.5

In [16]:
class Luggage:
    
    def __init__(self,weight_lbs,height_in,width_in,depth_in,color):
        self.weight_lbs=weight_lbs
        self.height_in=height_in
        self.width_in=width_in
        self.depth_in=depth_in
        self.color=color
        
    def cubic_inches(self):
        return self.height_in*self.width_in*self.depth_in

In [18]:
my_bag= Luggage(50.,20,20,20,"Red")

In [19]:
my_bag.height_in

my_bag.cubic_inches()

8000

In [ ]:
#  list comprehensions

x = "Yes" if 536% 3 ==0 else"No"

In [26]:
x = list(range(0,100))

y1 = list(filter(lambda n: n%7 == 0, x))
y1=list(map(lambda n:n/2, y1))
y= [z / 2 for z in x if z % 7 == 0]
print(y)
print(y1)

[0.0, 3.5, 7.0, 10.5, 14.0, 17.5, 21.0, 24.5, 28.0, 31.5, 35.0, 38.5, 42.0, 45.5, 49.0]
[0.0, 3.5, 7.0, 10.5, 14.0, 17.5, 21.0, 24.5, 28.0, 31.5, 35.0, 38.5, 42.0, 45.5, 49.0]

In [28]:
alphabet = "abshchaiuhdhksajbkdbqwjbkjbaskdbkawbkbsdka"
voewls = "aeiouy"

consonants1="".join([i for i in alphabet if i not in voewls])
print(consonants1)

consonants = list(filter(lambda x: x not in voewls, alphabet))
consonants = "".join(consonants)

consonants

bshchhdhksjbkdbqwjbkjbskdbkwbkbsdk

'bshchhdhksjbkdbqwjbkjbskdbkwbkbsdk'

In [32]:
import time

time_before = time.time()
for i in range(100):
    for j in range (100):
        for k in range (100):
            x = i * j* k
time_after = time.time()

time_elapsed = time_after -time_before
time_elapsed

0.06500720977783203

In [33]:
import os
os.getcwd()

'C:\\Users\\yq89_'

In [ ]:
#  big "O" notation

def constant_time(l):
    return 1
#O(1)

def linear_time(l):
    for element in l:
        x= l/2      
# O(n)

def square_time(l):
    for element in l:
        for element2 in l:
            x = element *element2
# O(x^2)

def binary_search(l):

In [42]:
file = open(r"C:\Users\yq89_\Desktop\example.txt","r")
# a -- append
# w -- write allowed dangerous 
# r -- read allowed

In [49]:
file = open(r"C:\Users\yq89_\Desktop\example.txt","r")
file.readline()

'"this is the data contained in a file!"\n'

In [40]:
file_data=file.read()

''

In [ ]:
file = open(r"C:\Users\yq89_\Desktop\example.txt","a")
file.write("xyz")

In [ ]:
file.close() 
# close first than read

In [ ]:
file.read()

In [ ]:
file_data= file.read()

In [ ]:
file_data.split("\n")
# \n means a new line

In [ ]:
file = open(r"C:\Users\yq89_\Desktop\example.txt","a")

In [51]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Downloading pandas-1.5.3-cp310-cp310-win_amd64.whl (10.4 MB)
     ---------------------------------------- 0.0/10.4 MB ? eta -:--:--
     -- ------------------------------------- 0.6/10.4 MB 13.1 MB/s eta 0:00:01
     ---- ----------------------------------- 1.3/10.4 MB 13.6 MB/s eta 0:00:01
     ------- -------------------------------- 2.0/10.4 MB 14.4 MB/s eta 0:00:01
     -------- ------------------------------- 2.3/10.4 MB 14.4 MB/s eta 0:00:01
     ----------- ---------------------------- 2.9/10.4 MB 12.4 MB/s eta 0:00:01
     ------------- -------------------------- 3.6/10.4 MB 12.8 MB/s eta 0:00:01
     ---------------- ----------------------- 4.3/10.4 MB 13.0 MB/s eta 0:00:01
     ------------------- -------------------- 4.9/10.4 MB 13.1 MB/s eta 0:00:01
     ---------------------- ----------------- 5.7/10.4 MB 13.5 MB/s eta 0:00:01
     ------------------------ --------------- 6.4/10.4 MB 13.6 MB/s eta 0:00:01
     --------------------------- ------------ 7.1/10.4 MB 13.8 MB/s eta 0:00:01
     ---------------------------- ----------- 7.4/10.4 MB 14.0 MB/s eta 0:00:01
     --------------------------------- ------ 8.6/10.4 MB 14.0 MB/s eta 0:00:01
     ----------------------------------- ---- 9.3/10.4 MB 14.2 MB/s eta 0:00:01
     ------------------------------------- - 10.0/10.4 MB 14.1 MB/s eta 0:00:01
     --------------------------------------- 10.4/10.4 MB 13.6 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\yq89_\appdata\roaming\python\python310\site-packages (from pandas) (2.8.2)
Collecting numpy>=1.21.0
  Downloading numpy-1.24.2-cp310-cp310-win_amd64.whl (14.8 MB)
     ---------------------------------------- 0.0/14.8 MB ? eta -:--:--
     - -------------------------------------- 0.6/14.8 MB 11.5 MB/s eta 0:00:02
     --- ------------------------------------ 1.3/14.8 MB 13.8 MB/s eta 0:00:01
     ----- ---------------------------------- 2.1/14.8 MB 14.8 MB/s eta 0:00:01
     ------- -------------------------------- 2.7/14.8 MB 14.6 MB/s eta 0:00:01
     --------- ------------------------------ 3.4/14.8 MB 14.4 MB/s eta 0:00:01
     ----------- ---------------------------- 4.1/14.8 MB 14.7 MB/s eta 0:00:01
     ------------- -------------------------- 4.9/14.8 MB 14.9 MB/s eta 0:00:01
     -------------- ------------------------- 5.6/14.8 MB 14.8 MB/s eta 0:00:01
     ----------------- ---------------------- 6.3/14.8 MB 14.9 MB/s eta 0:00:01
     ------------------- -------------------- 7.1/14.8 MB 15.0 MB/s eta 0:00:01
     ------------------- -------------------- 7.4/14.8 MB 14.7 MB/s eta 0:00:01
     ---------------------- ----------------- 8.5/14.8 MB 15.1 MB/s eta 0:00:01
     ------------------------ --------------- 9.2/14.8 MB 15.0 MB/s eta 0:00:01
     -------------------------- ------------- 9.9/14.8 MB 15.1 MB/s eta 0:00:01
     --------------------------- ----------- 10.5/14.8 MB 15.2 MB/s eta 0:00:01
     ----------------------------- --------- 11.2/14.8 MB 14.9 MB/s eta 0:00:01
     ------------------------------- ------- 11.8/14.8 MB 14.9 MB/s eta 0:00:01
     -------------------------------- ------ 12.5/14.8 MB 14.9 MB/s eta 0:00:01
     ---------------------------------- ---- 13.2/14.8 MB 14.9 MB/s eta 0:00:01
     ------------------------------------ -- 14.0/14.8 MB 14.9 MB/s eta 0:00:01
     --------------------------------------  14.6/14.8 MB 14.9 MB/s eta 0:00:01
     --------------------------------------- 14.8/14.8 MB 14.5 MB/s eta 0:00:00
Collecting pytz>=2020.1
  Downloading pytz-2022.7.1-py2.py3-none-any.whl (499 kB)
     ---------------------------------------- 0.0/499.4 kB ? eta -:--:--
     ------------------------------------- 499.4/499.4 kB 15.8 MB/s eta 0:00:00
Requirement already satisfied: six>=1.5 in c:\users\yq89_\appdata\roaming\python\python310\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.24.2 pandas-1.5.3 pytz-2022.7.1
Note: you may need to restart the kernel to use updated packages.

  WARNING: The script f2py.exe is installed in 'C:\Users\yq89_\AppData\Roaming\Python\Python310\Scripts' which is not on PATH.
  Consider adding this directory to PATH or, if you prefer to suppress this warning, use --no-warn-script-location.

In [57]:
x = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]


import pandas as pd

df = pd.DataFrame(x,columns=["col1","col2","col3"],index=["row1","row2","row3"])
df

      col1  col2  col3
row1     1     2     3
row2     4     5     6
row3     7     8     9

In [58]:
df["col2"].sum()

15

In [62]:
# loc and iloc both row first
df.loc[["row1","row3"],"col1"].sum()

8

In [63]:
# index notation
df.iloc[0:2,1:3]

      col2  col3
row1     2     3
row2     5     6

In [64]:
# change colomn to row (default is axis =0 means colomn)
df.sum(axis=1)

row1     6
row2    15
row3    24
dtype: int64

In [71]:
df.iloc[:,0]=df.iloc[:,0]/2
df

      col1  col2  col3
row1  0.25     2     3
row2  1.00     5     6
row3  1.75     8     9

In [69]:
df.iloc[:,0]

row1    1
row2    4
row3    7
Name: col1, dtype: int64

In [74]:
x = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]

df = pd.DataFrame(x)
df.loc[:,3] =[10,11,12]
# .loc can extend things, .iloc can't 
df

   0  1  2   3
0  1  2  3  10
1  4  5  6  11
2  7  8  9  12

In [75]:
df.loc[3,:] =[13,14,15,16]
df

      0     1     2     3
0   1.0   2.0   3.0  10.0
1   4.0   5.0   6.0  11.0
2   7.0   8.0   9.0  12.0
3  13.0  14.0  15.0  16.0

In [78]:
mask = df.loc[:,0]% 2!=0
df[mask]

      0     1     2     3
0   1.0   2.0   3.0  10.0
2   7.0   8.0   9.0  12.0
3  13.0  14.0  15.0  16.0

In [79]:
x = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
df = pd.DataFrame(x,columns=["col1","col2","col3"],index=["row1","row2","row3"])

In [81]:
df.rename({"col1":"first_col"},axis=1)
df.rename({"row1":"first_row"})

           col1  col2  col3
first_row     1     2     3
row2          4     5     6
row3          7     8     9

In [82]:
ex_df = pd.read_csv(r"C:\Users\yq89_\Desktop\example.csv")
ex_df

   student grade  gpa
0     toby    C-  2.4
1      ray    A+  4.0
2  charlie     A  3.8
3      joe    B+  3.5
4      meg    A-  3.9

In [83]:
ex_df.loc[0,"student"]="Toby Mac"

In [94]:
ex_df

   Unnamed: 0   student grade  gpa
0           0  Toby Mac    C-  2.4
1           1       ray    A+  4.0
2           2   charlie     A  3.8
3           3       joe    B+  3.5
4           4       meg    A-  3.9

In [91]:
ex_df.to_csv(r"C:\Users\yq89_\Desktop\example.csv",index=False)

In [92]:
ex_df = pd.read_csv(r"C:\Users\yq89_\Desktop\example.csv")
ex_df

   Unnamed: 0   student grade  gpa
0           0  Toby Mac    C-  2.4
1           1       ray    A+  4.0
2           2   charlie     A  3.8
3           3       joe    B+  3.5
4           4       meg    A-  3.9

In [93]:
mask = ex_df.loc[:,"gpa"] > 3.5

In [89]:
ex_df[mask].loc[:,"gpa"].mean()

3.9

In [90]:
ex_df[mask].iloc[:,3].mean()

3.9

In [98]:
excel = pd.read_excel(r"C:\Users\yq89_\Desktop\example.xlsx")
excel

   student grade  gpa
0     toby    C-  2.4
1      ray    A+  4.0
2  charlie     A  3.8
3      joe    B+  3.5
4      meg    A-  3.9

In [99]:
excel_sheet_one = pd.read_excel(r"C:\Users\yq89_\Desktop\example.xlsx")
excel_sheet_two = pd.read_excel(r"C:\Users\yq89_\Desktop\example.xlsx",1)

In [97]:
pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Collecting openpyxl
  Downloading openpyxl-3.1.1-py2.py3-none-any.whl (249 kB)
     ---------------------------------------- 0.0/249.8 kB ? eta -:--:--
     -------------------------------------- 249.8/249.8 kB 7.7 MB/s eta 0:00:00
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.1
Note: you may need to restart the kernel to use updated packages.

In [100]:
excel_sheet_one

   student grade  gpa
0     toby    C-  2.4
1      ray    A+  4.0
2  charlie     A  3.8
3      joe    B+  3.5
4      meg    A-  3.9

In [101]:
excel_sheet_two

   student      location
0     toby           NYC
1      ray         Tampa
2  charlie       Orlando
3      joe  Indianapolis
4      meg       Seattle

In [102]:
pd.merge(excel_sheet_one,excel_sheet_two, on=["student","student"], how="inner")

# inner or left or right  different join can be used in how

   student grade  gpa      location
0     toby    C-  2.4           NYC
1      ray    A+  4.0         Tampa
2  charlie     A  3.8       Orlando
3      joe    B+  3.5  Indianapolis
4      meg    A-  3.9       Seattle